recipes/oat-lentil-meat-loaf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oat &amp; Lentil "Meat Loaf"</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Oat &amp; Lentil "Meat Loaf"</h1>
<p>
<a href="https://gamechangersmovie.com/recipes/oat-lentil-meat-loaf/">Original link</a>
</p>

<div id="outline-container-orge485621" class="outline-2">
<h2 id="orge485621">Ingredients</h2>
<div class="outline-text-2" id="text-orge485621">
<ul class="org-ul">
<li>2 medium carrots, grated</li>
<li>1 zuchinni, grated</li>
<li>1/2 onion, chopped</li>
<li>2 cloves garlic, minced or pressed</li>
<li>300g firm tofu, drained</li>
<li>1/4 cup walnuts, finely ground</li>
<li>1/2 cup cooked brown lentils</li>
<li>1 1/4 cups quick-cooking oats</li>
<li>3 tablespoons soy sauce</li>
<li>2 tablespoons BBQ sauce or ketchup (plus additional for topping)</li>
<li>1 tablespoon Dijon mustard</li>
<li>2 teaspoons dried parsley</li>
<li>1/2 teaspoon thyme</li>
<li>1/2 teaspoon sage</li>
<li>1/2 teaspoon rosemary</li>
</ul>
</div>
</div>

<div id="outline-container-orge3e1ef3" class="outline-2">
<h2 id="orge3e1ef3">Method</h2>
<div class="outline-text-2" id="text-orge3e1ef3">
<ol class="org-ol">
<li>Preheat the oven to 190&deg;C.</li>
<li>Saute the carrot, zuchinni, onion, and garlic on high heat in a skillet with a few drops of water for 5 minutes, until tender. Remove from heat and cool.</li>
<li>Mash the tofu in a large bowl. Stir in the cooked mixture and remaining ingredients, and combine well.</li>
<li>Spoon the mixture into a parchment-lined loaf pan. Top with a layer of BBQ sauce.</li>
<li>Bake for 55-60 minutes, or until a toothpick inserted in the center comes out clean.</li>
</ol>
</div>
</div>

<div id="outline-container-orgdbf0cf1" class="outline-2">
<h2 id="orgdbf0cf1">Tips</h2>
<div class="outline-text-2" id="text-orgdbf0cf1">
<ul class="org-ul">
<li>This meatloaf is wonderful the next day pan-fried on whole grain bread with mustard, pickles, and ketchup.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
